In [11]:
import pandas as pd

In [12]:
dfclientes = pd.read_excel('caso_estudo.xlsx', sheet_name = 'clientes')
dflojas = pd.read_excel('caso_estudo.xlsx', sheet_name = 'lojas')
dfprodutos = pd.read_excel('caso_estudo.xlsx', sheet_name = 'produtos')
dfpagamentos = pd.read_excel('caso_estudo.xlsx', sheet_name = 'pagamentos')
dfvendas = pd.read_excel('caso_estudo.xlsx', sheet_name = 'vendas')

In [13]:
dfclientes.isnull().sum()

id         0
nome       4
sexo       4
dt_nasc    4
dtype: int64

In [14]:
dfclientes[dfclientes.isnull().T.any()]

      id               nome sexo     dt_nasc
263  264                NaN    F   7/29/1997
264  265                NaN    M    2/7/1979
268  269                NaN    F         NaN
269  270                NaN    M         NaN
276  277      Brenda Santos    F         NaN
282  283      Amanda Barros    F         NaN
287  288     Victor Ribeiro  NaN  12/17/1974
290  291        Clara Pinto  NaN  12/25/1980
294  295         Tiago Lima  NaN   7/26/1973
301  302  Guilherme Cardoso  NaN    3/9/1998

# DATA CLEANNING #

## Dados Nulos

In [16]:
dfclientes.loc[dfclientes.nome.isnull(), 'nome']= 'sem nome'
dfclientes.loc[dfclientes.sexo.isnull(), 'sexo']= 'o'
dfclientes.loc[dfclientes.dt_nasc.isnull(), 'dt_nasc']= '1/1/2020'

# Outliers

In [17]:
dfprodutos.loc[9,'valor'] = dfprodutos.valor[9]/10000

In [18]:
dfprodutos

   id        produto      valor
0   1          mouse    20.0000
1   2        teclado    30.0000
2   3  laptop básico  2300.0000
3   4   laptop gamer  5300.0000
4   5        monitor  1500.0000
5   6     impressora   700.0000
6   7     carregador   150.0000
7   8        cadeira   540.0000
8   9           mesa   860.0000
9  10       xxx-231a   321.1352

# Consistencia

In [23]:
dfvendas[~dfvendas.id_cliente.isin(dfclientes.id)]

Empty DataFrame
Columns: [id, id_cliente, id_loja, id_produto, dt_venda]
Index: []

# Buscando dados Duplicados

In [30]:
dfclientes[dfclientes.nome.duplicated()]

       id                nome sexo     dt_nasc
79     80           Anna Melo    F   8/10/1999
96     97  Beatrice Goncalves    F  11/22/1964
138   139         Kauê Araujo    M   5/31/1974
139   140        Leonor Sousa    F    8/2/1981
154   155      Luis Rodrigues    M    7/3/1973
..    ...                 ...  ...         ...
986   987     Beatriz Cardoso    F   7/17/1984
990   991          Diogo Melo    M   7/24/2001
993   994       Eduardo Costa    M  12/18/1963
996   997      Laura Oliveira    F   6/15/1979
999  1000     Gustavo Barbosa    M  12/30/1975

[109 rows x 4 columns]

In [32]:
dfclientes.drop('id', axis = 1).duplicated().sum()

0

In [33]:
dfprodutos.produto.duplicated().sum()

0

In [35]:
dfvendas.duplicated().sum()

0

In [40]:
dfvendas[dfvendas.drop('id', axis =1).duplicated()]

      id  id_cliente  id_loja  id_produto   dt_venda
496  497         559        2           5 2018-06-22

# Formatando Dados

In [42]:
dfclientes.dt_nasc = pd.to_datetime(dfclientes.dt_nasc, format = '%m/%d/%Y')

In [50]:
dfclientes

                   nome sexo    dt_nasc
id
1         Lavinia Sousa    F 1975-05-02
2          Caio Pereira    M 1978-04-16
3         Júlio Azevedo    M 1952-11-04
4       Sarah Goncalves    F 1937-02-24
5     Gabrielle Martins    F 1953-05-06
...                 ...  ...        ...
996      Ágatha Ribeiro    F 1946-02-08
997      Laura Oliveira    F 1979-06-15
998       Lara Oliveira    F 1946-03-15
999        Julian Cunha    M 1994-06-20
1000    Gustavo Barbosa    M 1975-12-30

[1000 rows x 3 columns]

# Definindo Index

In [51]:
dfclientes = dfclientes.set_index('id')

KeyError: "None of ['id'] are in the columns"

In [52]:
dfpagamentos = dfpagamentos.set_index('id')

In [53]:
dfvendas = dfvendas.set_index('id')

In [54]:
dflojas = dflojas.set_index('id')

In [55]:
dfprodutos = dfprodutos.set_index('id')

# Data Fusion